---
kind: property
id: P:Autodesk.Revit.DB.Electrical.ElectricalLoadClassification.PanelEstimatedLabel
source: html/1d2a2be1-c058-ce8a-009b-8a896040ffba.htm
---
# Autodesk.Revit.DB.Electrical.ElectricalLoadClassification.PanelEstimatedLabel Property

The name template for the estimated demand parameter on the load classification.

## Syntax (C#)
```csharp
public string PanelEstimatedLabel { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentException** - When setting this property: panelEstimatedLabel is not a valid globalization format string.
- **Autodesk.Revit.Exceptions.ArgumentNullException** - When setting this property: A non-optional argument was null